# Homebrew Bundle file for dotfiles environment
# Run with: brew bundle

# Taps
tap "cue-lang/tap"
tap "dbcli/tap"
tap "minio/stable"
tap "yqrashawn/goku"

# Core tools
brew "bash"
brew "coreutils"
brew "git"
brew "gnupg"
brew "openssl"
brew "wget"
brew "zsh"

# Search and file tools
brew "ripgrep"                    # Modern grep replacement
brew "tree"
brew "ranger"                     # File browser
brew "highlight"                  # Syntax highlighting
brew "hexyl"                      # Hex viewer

# Development tools
brew "cmake"
brew "ctags"
brew "shellcheck"
brew "cloc"                       # Count lines of code
brew "jq"                         # JSON processor
brew "yq"                         # YAML processor

# Editors
brew "neovim"

# Terminal and shell
brew "tmux"
brew "reattach-to-user-namespace" # For tmux clipboard
brew "starship"                   # Cross-shell prompt
brew "zoxide"                     # Smarter cd

# Cloud and containers
brew "awscli"
brew "google-cloud-sdk"
brew "terraform"
brew "sops"                       # Encrypted file editor

# Kubernetes
brew "docker", cask: true
brew "helm"
brew "kind"
brew "k3d"
brew "k9s"
brew "kubectl"
brew "kubectx"

# Languages and package managers
brew "go"
brew "node"
brew "yarn"
brew "pnpm"
brew "python"
brew "pipx"
brew "pyenv"
brew "rbenv"
brew "r"

# Java/Scala ecosystem
brew "scala"
brew "apache-spark"
brew "kafka"
brew "kafkacat"

# Databases
brew "postgresql"
brew "redis"
brew "sqlite"
brew "rocksdb"
brew "litecli"                    # SQLite CLI with autocomplete
brew "pgcli"                      # PostgreSQL CLI with autocomplete

# Data tools
brew "jsonnet"
brew "lightgbm"
brew "graphviz"

# Dhall configuration language
brew "dhall"
brew "dhall-json"
brew "dhall-lsp-server"

# HTTP tools
brew "httpie"
brew "nginx"
brew "websocat"                   # WebSocket client
brew "ngrok", cask: true

# Git tools
brew "hub"                        # GitHub CLI
brew "diff-so-fancy"              # Better git diffs

# Monitoring
brew "glances"                    # System monitoring

# Media tools
brew "youtube-dl"
brew "exiftool"

# Other tools
brew "devd"                       # Local web server
brew "modd"                       # File watcher
brew "stylua"                     # Lua formatter

# Custom taps
brew "cue-lang/tap/cue"           # CUE data language
brew "minio/stable/minio"         # Object storage
brew "minio/stable/mc"            # MinIO client
brew "yqrashawn/goku/goku"        # Karabiner configurator

# Casks (GUI applications)
cask "alacritty"                  # GPU-accelerated terminal
cask "anaconda"                   # Python data science platform
cask "gitify"                     # GitHub notifications
